<a href="https://colab.research.google.com/github/KomilovQobiljon/databasemanagementUNI/blob/main/Week10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from sqlalchemy import create_engine
my_conn = create_engine('sqlite:////content/my_db.db')

In [3]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT * FROM student WHERE mark BETWEEN 65 AND 75"
try:
  r_set=my_conn.execute(q)  
  r_list=r_set.fetchall()
  for row in r_list:
    print(row)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ",len(r_list))

(1, 'John Deo', 'Four', 75, 'female')
(18, 'Honny', 'Five', 75, 'male')
(20, 'Jackly', 'Nine', 65, 'female')
(21, 'Babby John', 'Four', 69, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
Total Number of rows :  5

In [7]:
from sqlalchemy.exc import SQLAlchemyError
my_tuple=(65,75)
q = "SELECT * FROM student WHERE mark BETWEEN ? AND ?"
try: 
  r_set = my_conn.execute(q, my_tuple)
  r_list = r_set.fetchall()
  for row in r_list:
    print(row)
except SQLAlchemyError as e:
  error = str(e.__dict__['orig'])
  print(e)
  print(error)
else:
  print('Total Numbe of rows: ', len(r_list))

(sqlite3.OperationalError) incomplete input
[SQL: SELECT * FROM student WHERE mark BETWEEN ? AND ]
[parameters: (65, 75)]
(Background on this error at: https://sqlalche.me/e/14/e3q8)
incomplete input

In [8]:
my_tuple = (25, 90)
q = "SELECT * FROM student WHERE mark NOT BETWEEN ? AND ?"
try:
  r_set = my_conn.execute(q,my_tuple)
  r_list = r_set.fetchall()
  for row in r_list:
    print(row)
except SQLAlchemyError as e:
  error = str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows: ", len(r_list))

(12, 'Recky', 'Six', 94, 'female')
(19, 'Tinny', 'Nine', 18, 'male')
(33, 'Kenn Rein', 'Six', 96, 'female')
Total Number of rows:  3

In [9]:
my_tuple = (25, 90)
q="SELECT * FROM student WHERE mark NOT BETWEEN ? AND ?"
try:
  r_set = my_conn.execute(q,my_tuple)
  r_list = r_set.fetchall()
  for row in r_list:
    print(row)
except SQLAlchemyError as e:
  error = str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows: ",len(r_list))

(12, 'Recky', 'Six', 94, 'female')
(19, 'Tinny', 'Nine', 18, 'male')
(33, 'Kenn Rein', 'Six', 96, 'female')
Total Number of rows:  3

In [11]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT * FROM student ORDER BY mark DESC"
try:
  r_set=my_conn.execute(q)  
  r_list=r_set.fetchall()
  for rows in r_list:
    print(rows)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ",len(r_list))

(33, 'Kenn Rein', 'Six', 96, 'female')
(12, 'Recky', 'Six', 94, 'female')
(32, 'Binn Rott', 'Seven', 90, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(13, 'Kty', 'Seven', 88, 'female')
(14, 'Bigy', 'Seven', 88, 'female')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(25, 'Giff Tow', 'Seven', 88, 'male')
(31, 'Marry Toeey', 'Four', 88, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(27, 'Big Nose', 'Three', 81, 'female')
(23, 'Herod', 'Eight', 79, 'male')
(26, 'Crelea', 'Seven', 79, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(7, 'My John Rob', 'Five', 78, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(24, 'Tiddy Now', 'Seven', 78, 'male')
(1, 'John Deo', 'Four', 75, 'female')
(18, 'Honny', 'Five', 75, 'male')
(21, 'Babby John', 'Four', 69, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(20, 'Jackly', 'Nine', 65, 'female')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(3, 'Arnold', 'Three', 55, 'male')
(6, 'Alex John', 'Four', 55, 'male')
(10, 'Big John', 'Four', 55, 'female')
(22, 'Reggid', 'Seven', 55, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(17, 'Tumyu', 'Six', 54, 'male')
(19, 'Tinny', 'Nine', 18, 'male')
Total Number of rows :  35

In [12]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT * FROM student WHERE class='Five' ORDER BY mark DESC"
try:
  r_set=my_conn.execute(q)  
  r_list=r_set.fetchall()
  for rows in r_list:
    print(rows)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ",len(r_list))

(8, 'Asruid', 'Five', 85, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(18, 'Honny', 'Five', 75, 'male')
Total Number of rows :  3

In [23]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT * FROM student WHERE class='Six' ORDER BY mark DESC LIMIT 0,10"
try:
  r_set=my_conn.execute(q)  
  r_list=r_set.fetchall()
  for rows in r_list:
    print(rows)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ",len(r_list))

(33, 'Kenn Rein', 'Six', 96, 'female')
(12, 'Recky', 'Six', 94, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(35, 'Rows Noump', 'Six', 88, 'female')
(30, 'Reppy Red', 'Six', 79, 'female')
(9, 'Tes Qry', 'Six', 78, 'male')
(17, 'Tumyu', 'Six', 54, 'male')
Total Number of rows :  7

In [25]:
import sqlite3
class Employee:
  def __init__(self, first, last, pay):
    self.first = first
    self.last = last
    self.pay = pay

conn = sqlite3.connect(':memory:')

c = conn.cursor()

c.execute("""CREATE TABLE employees (
            first text,
            last text,
            pay integer
            )""")


def insert_emp(emp):
    with conn:
        c.execute("INSERT INTO employees VALUES (:first, :last, :pay)", {'first': emp.first, 'last': emp.last, 'pay': emp.pay})


def get_emps_by_name(lastname):
    c.execute("SELECT * FROM employees WHERE last=:last", {'last': lastname})
    return c.fetchall()


def update_pay(emp, pay):
    with conn:
        c.execute("""UPDATE employees SET pay = :pay
                    WHERE first = :first AND last = :last""",
                  {'first': emp.first, 'last': emp.last, 'pay': pay})


def remove_emp(emp):
    with conn:
        c.execute("DELETE from employees WHERE first = :first AND last = :last",
                  {'first': emp.first, 'last': emp.last})

emp_1 = Employee('John', 'Doe', 80000)
emp_2 = Employee('Jane', 'Doe', 90000)

insert_emp(emp_1)
insert_emp(emp_2)

emps = get_emps_by_name('Doe')
print(emps)

update_pay(emp_2, 95000)
remove_emp(emp_1)

emps = get_emps_by_name('Doe')
print(emps)

conn.close()

[('John', 'Doe', 80000), ('Jane', 'Doe', 90000)]
[('Jane', 'Doe', 95000)]